## Importación y descripción

In [1]:
import pandas as pd

In [3]:
nba = pd.read_csv("nba.csv")
nba.head(7)

            Name            Team  Number  ... Weight            College      Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas   7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette   6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University         NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State   1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN   5000000.0
5   Amir Johnson  Boston Celtics    90.0  ...  240.0                NaN  12000000.0
6  Jordan Mickey  Boston Celtics    55.0  ...  235.0                LSU   1170960.0

[7 rows x 9 columns]

In [5]:
nba.shape

(458, 9)

In [7]:
nba.dtypes

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

In [9]:
nba.dtypes.value_counts()

object     5
float64    4
dtype: int64

In [10]:
nba.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [12]:
nba.columns = ['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight', 'University', 'Salary']
nba.head(5)

            Name            Team  Number  ... Weight         University     Salary
0  Avery Bradley  Boston Celtics     0.0  ...  180.0              Texas  7730337.0
1    Jae Crowder  Boston Celtics    99.0  ...  235.0          Marquette  6796117.0
2   John Holland  Boston Celtics    30.0  ...  205.0  Boston University        NaN
3    R.J. Hunter  Boston Celtics    28.0  ...  185.0      Georgia State  1148640.0
4  Jonas Jerebko  Boston Celtics     8.0  ...  231.0                NaN  5000000.0

[5 rows x 9 columns]

In [13]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        457 non-null    object
 1   Team        457 non-null    object
 2   Number      457 non-null    float64
 3   Position    457 non-null    object
 4   Age         457 non-null    float64
 5   Height      457 non-null    object
 6   Weight      457 non-null    float64
 7   University  373 non-null    object
 8   Salary      446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

In [15]:
round(nba.describe(), 2)

       Number     Age  Weight       Salary
count  457.00  457.00  457.00       446.00
mean    17.68   26.94  221.52   4842684.11
std     15.97    4.40   26.37   5229237.60
min      0.00   19.00  161.00     30888.00
25%      5.00   24.00  200.00   1044792.25
50%     13.00   26.00  220.00   2839073.00
75%     25.00   30.00  240.00   6500000.00
max     99.00   40.00  307.00  25000000.00

## Transformación de tipos de datos

In [22]:
sales = pd.read_excel("sales.xlsx", usecols = [1,2,3,4,5,6])
sales.head()

  first_name last_name      gender        date  local_num             city
0     Belita    Egdell      Female  13/09/2020       2.54       Åtvidaberg
1   Roseline  Kalinsky    Bigender  30/07/2020      83.85       Carbajales
2     Pamela   Pippard  Polygender  14/01/2021      25.04    Starominskaya
3     Lenard    Skones  Polygender  26/12/2020      38.72         Sabangan
4      Verne  Shackell  Polygender  12/10/2020      47.91  Cawayan Bugtong

In [23]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  1000 non-null   object
 1   last_name   1000 non-null   object
 2   gender      1000 non-null   object
 3   date        1000 non-null   object
 4   local_num   1000 non-null   float64
 5   city        1000 non-null   object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [26]:
sales["local_num"] = sales["local_num"].astype(float)

In [27]:
sales.head()

  first_name last_name      gender        date  local_num             city
0     Belita    Egdell      Female  13/09/2020        2.0       Åtvidaberg
1   Roseline  Kalinsky    Bigender  30/07/2020       83.0       Carbajales
2     Pamela   Pippard  Polygender  14/01/2021       25.0    Starominskaya
3     Lenard    Skones  Polygender  26/12/2020       38.0         Sabangan
4      Verne  Shackell  Polygender  12/10/2020       47.0  Cawayan Bugtong

In [28]:
sales["gender"] = sales["gender"].astype('category')

In [29]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  1000 non-null   object
 1   last_name   1000 non-null   object
 2   gender      1000 non-null   category
 3   date        1000 non-null   object
 4   local_num   1000 non-null   float64
 5   city        1000 non-null   object
dtypes: category(1), float64(1), object(4)
memory usage: 40.5+ KB

In [32]:
sales.sort_values("city", ascending=True).head()

    first_name   last_name  ... local_num              city
216    Emanuel  Bridgeland  ...      74.0        A-da-Gorda
543     Heidie      Rousby  ...      65.0           Aasiaat
181     Tonnie    Bunworth  ...      70.0  Abdurahmoni Jomí
692      Barth      Stagge  ...      11.0         Abelheira
314    Janette    Thwaites  ...      98.0         Abelheira

[5 rows x 6 columns]

In [ ]:
sales.sort_values(["gender", "local_num"]).head(15)

In [36]:
sales["gender"].value_counts()

Bigender       143
Male           142
Non-binary     140
Genderfluid    130
Genderqueer    115
Agender        113
Female         112
Polygender     105
Name: gender, dtype: int64

## Fechas

In [38]:
import datetime as dt

In [39]:
undia = dt.date(2021,4,14)
undia

datetime.date(2021, 4, 14)

In [44]:
print(undia.year)
print(undia.month)
print(undia.day)

2021
4
14

In [45]:
un_momento = dt.datetime(2021,4,14,20,19,30)
un_momento

datetime.datetime(2021, 4, 14, 20, 19, 30)

In [50]:
print(un_momento.hour)
print(un_momento.minute)
print(un_momento.second)

20
19
30

In [57]:
print(pd.Timestamp("2021-4-14"))
print(pd.Timestamp("2021/4/14"))
print(pd.Timestamp("2021, 4, 14"))
print(pd.Timestamp("14/4/2021"))
print(pd.Timestamp("2021-4-14 20:30:45"))
print(pd.Timestamp("2021/4/14 8:30:45 PM"))

2021-04-14 00:00:00
2021-04-14 00:00:00
2021-04-14 00:00:00
2021-04-14 00:00:00
2021-04-14 20:30:45
2021-04-14 20:30:45

In [59]:
print(pd.to_datetime("2014-5-15"))
print(pd.to_datetime(["2021/4/14", "2014/08/14", "2018", "December 20th, 1991"]))

2014-05-15 00:00:00
DatetimeIndex(['2021-04-14', '2014-08-14', '2018-01-01', '1991-12-20'], dtype='datetime64[ns]', freq=None)

In [60]:
times = pd.Series(["2021/4/14", "2014/08/14", "2018", "December 20th, 1991"])
times

0              2021/4/14
1             2014/08/14
2                   2018
3    December 20th, 1991
dtype: object

In [61]:
pd.to_datetime(times)

0   2021-04-14
1   2014-08-14
2   2018-01-01
3   1991-12-20
dtype: datetime64[ns]

In [62]:
sales["date"] = pd.to_datetime(sales["date"])
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  1000 non-null   object
 1   last_name   1000 non-null   object
 2   gender      1000 non-null   category
 3   date        1000 non-null   datetime64[ns]
 4   local_num   1000 non-null   float64
 5   city        1000 non-null   object
dtypes: category(1), datetime64[ns](1), float64(1), object(3)
memory usage: 40.5+ KB

In [63]:
sales.head()

  first_name last_name      gender       date  local_num             city
0     Belita    Egdell      Female 2020-09-13        2.0       Åtvidaberg
1   Roseline  Kalinsky    Bigender 2020-07-30       83.0       Carbajales
2     Pamela   Pippard  Polygender 2021-01-14       25.0    Starominskaya
3     Lenard    Skones  Polygender 2020-12-26       38.0         Sabangan
4      Verne  Shackell  Polygender 2020-12-10       47.0  Cawayan Bugtong

In [64]:
pd.read_excel("sales.xlsx", 
              parse_dates = ["date"]).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          1000 non-null   int64
 1   first_name  1000 non-null   object
 2   last_name   1000 non-null   object
 3   gender      1000 non-null   object
 4   date        1000 non-null   datetime64[ns]
 5   local_num   1000 non-null   float64
 6   city        1000 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(1), object(4)
memory usage: 54.8+ KB

In [65]:
x = pd.to_datetime("2021-12-10")
y = pd.to_datetime("2021-12-12")

y - x

Timedelta('2 days 00:00:00')